iostat-pgbench-kernel/ubuntu-10.04/2.6.32-38-server/pgbench-ro/report.txt
transaction type: SELECT only
scaling factor: 1000
query mode: simple
number of clients: 16
number of threads: 4
duration: 300 s
number of transactions actually processed: 616892
tps = 2056.074502 (including connections establishing)
tps = 2056.158949 (excluding connections establishing)
statement latencies in milliseconds:
	0.006842	\set naccounts 100000 * :scale
	0.004678	\setrandom aid 1 :naccounts
	7.750922	SELECT abalance FROM pgbench_accounts WHERE aid = :aid;